# 1 - Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
letra = ['A','B','C']
numero = [10, 20, 30]
arrey = np.array([10, 20, 30])
dicionario = {'A':10, 'B':20, 'C':30}

In [3]:
pd.Series(letra)

0    A
1    B
2    C
dtype: object

In [4]:
pd.Series(data=letra, index=numero)

10    A
20    B
30    C
dtype: object

In [5]:
dicionario

{'A': 10, 'B': 20, 'C': 30}

In [6]:
pd.Series(dicionario)

A    10
B    20
C    30
dtype: int64

In [7]:
serie1 = pd.Series([1,2,3,4], index=["Brasil", "Japão", "Russia", "EUA"])
serie1

Brasil    1
Japão     2
Russia    3
EUA       4
dtype: int64

In [8]:
serie2 = pd.Series([1,4,8,0], index=["Brasil", "Japão", "URSS", "EUA"])
serie2

Brasil    1
Japão     4
URSS      8
EUA       0
dtype: int64

In [9]:
serie1["Japão"]

2

In [10]:
serie2[["URSS", "EUA"]]

URSS    8
EUA     0
dtype: int64

In [11]:
serie1 + serie2

Brasil    2.0
EUA       4.0
Japão     6.0
Russia    NaN
URSS      NaN
dtype: float64

# 2 - DataFrames

In [12]:
from numpy.random import randn

In [13]:
df = pd.DataFrame(randn(5, 4), index="A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
B -0.882391  1.066298 -0.328338 -0.427342
C  0.648985 -0.235520 -0.368386  0.540147
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [14]:
df["W"]

A    0.523874
B   -0.882391
C    0.648985
D   -0.528092
E   -1.155985
Name: W, dtype: float64

In [15]:
type(df["W"])

pandas.core.series.Series

In [16]:
df[["W", "Z"]]

          W         Z
A  0.523874  0.518047
B -0.882391 -0.427342
C  0.648985  0.540147
D -0.528092  0.612275
E -1.155985 -0.088615

## Criar nova coluna POREM copiando os dados de outra coluna

In [17]:
df["Novo"] = df["W"]
df

          W         X         Y         Z      Novo
A  0.523874 -0.046648  0.747173  0.518047  0.523874
B -0.882391  1.066298 -0.328338 -0.427342 -0.882391
C  0.648985 -0.235520 -0.368386  0.540147  0.648985
D -0.528092  0.102182  0.858818  0.612275 -0.528092
E -1.155985 -0.413461  1.226777 -0.088615 -1.155985

In [18]:
del df["Novo"]
df

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
B -0.882391  1.066298 -0.328338 -0.427342
C  0.648985 -0.235520 -0.368386  0.540147
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [19]:
df["Novo"] = df["W"]
df.drop('Novo', axis=1)
# Opção sem Retorno
df.drop('Novo', axis=1, inplace=True)

In [20]:
df.loc["A"]

W    0.523874
X   -0.046648
Y    0.747173
Z    0.518047
Name: A, dtype: float64

In [21]:
df.loc[["A", "C", "E"]]

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
C  0.648985 -0.235520 -0.368386  0.540147
E -1.155985 -0.413461  1.226777 -0.088615

In [22]:
df.iloc[0,2]

0.7471730331843621

# 3 - Filtros

In [23]:
df

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
B -0.882391  1.066298 -0.328338 -0.427342
C  0.648985 -0.235520 -0.368386  0.540147
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [24]:
df.loc[["A","B"], "Z"]

A    0.518047
B   -0.427342
Name: Z, dtype: float64

In [25]:
df.loc[["A","B"], ["Z"]]

          Z
A  0.518047
B -0.427342

In [26]:
df.iloc[:-3, 3:]

          Z
A  0.518047
B -0.427342

In [27]:
df.iloc[1:4, 1:3]

          X         Y
B  1.066298 -0.328338
C -0.235520 -0.368386
D  0.102182  0.858818

In [28]:
df

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
B -0.882391  1.066298 -0.328338 -0.427342
C  0.648985 -0.235520 -0.368386  0.540147
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [29]:
df + df

          W         X         Y         Z
A  1.047747 -0.093297  1.494346  1.036094
B -1.764781  2.132597 -0.656676 -0.854685
C  1.297970 -0.471040 -0.736772  1.080294
D -1.056183  0.204365  1.717636  1.224550
E -2.311970 -0.826921  2.453553 -0.177229

In [30]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C   True  False  False   True
D  False   True   True   True
E  False  False   True  False

In [31]:
df[df > 0]

          W         X         Y         Z
A  0.523874       NaN  0.747173  0.518047
B       NaN  1.066298       NaN       NaN
C  0.648985       NaN       NaN  0.540147
D       NaN  0.102182  0.858818  0.612275
E       NaN       NaN  1.226777       NaN

In [32]:
df[df["Y"] > 0]

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [33]:
df[( df["Y"] > 0) & (df["W"] > 0 )]

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047

In [34]:
( df["Y"] > 0) & (df["W"] > 0 )

A     True
B    False
C    False
D    False
E    False
dtype: bool

# 4 - Índices

In [35]:
df

          W         X         Y         Z
A  0.523874 -0.046648  0.747173  0.518047
B -0.882391  1.066298 -0.328338 -0.427342
C  0.648985 -0.235520 -0.368386  0.540147
D -0.528092  0.102182  0.858818  0.612275
E -1.155985 -0.413461  1.226777 -0.088615

In [36]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [37]:
df.reset_index()
df.reset_index(inplace=True)

In [38]:
df

  index         W         X         Y         Z
0     A  0.523874 -0.046648  0.747173  0.518047
1     B -0.882391  1.066298 -0.328338 -0.427342
2     C  0.648985 -0.235520 -0.368386  0.540147
3     D -0.528092  0.102182  0.858818  0.612275
4     E -1.155985 -0.413461  1.226777 -0.088615

In [39]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A      0.523874 -0.046648  0.747173  0.518047
B     -0.882391  1.066298 -0.328338 -0.427342
C      0.648985 -0.235520 -0.368386  0.540147
D     -0.528092  0.102182  0.858818  0.612275
E     -1.155985 -0.413461  1.226777 -0.088615

In [40]:
indexNovo = "DF GO SP RJ RN".split()
df["novo_index"] = indexNovo
df

              W         X         Y         Z novo_index
index
A      0.523874 -0.046648  0.747173  0.518047         DF
B     -0.882391  1.066298 -0.328338 -0.427342         GO
C      0.648985 -0.235520 -0.368386  0.540147         SP
D     -0.528092  0.102182  0.858818  0.612275         RJ
E     -1.155985 -0.413461  1.226777 -0.088615         RN

In [41]:
df.set_index("novo_index", inplace=True)
df

                   W         X         Y         Z
novo_index
DF          0.523874 -0.046648  0.747173  0.518047
GO         -0.882391  1.066298 -0.328338 -0.427342
SP          0.648985 -0.235520 -0.368386  0.540147
RJ         -0.528092  0.102182  0.858818  0.612275
RN         -1.155985 -0.413461  1.226777 -0.088615

In [42]:
df.reset_index().set_index("novo_index")
df

                   W         X         Y         Z
novo_index
DF          0.523874 -0.046648  0.747173  0.518047
GO         -0.882391  1.066298 -0.328338 -0.427342
SP          0.648985 -0.235520 -0.368386  0.540147
RJ         -0.528092  0.102182  0.858818  0.612275
RN         -1.155985 -0.413461  1.226777 -0.088615

# 5 - Hierarquia & Índices Multiplos

In [43]:
fora = "G1 G1 G1 G2 G2 G2".split()
dentro = [1,2,3, 1,2,3]
hierarkia_index = list(zip(fora, dentro))
hierarkia_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [44]:
hierarkia_index = pd.MultiIndex.from_tuples(hierarkia_index)
hierarkia_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df = pd.DataFrame(np.random.randn(6, 2), index=hierarkia_index, columns=["A","B"])
df

             A         B
G1 1  1.417773 -1.730436
   2 -0.964440 -0.863955
   3 -1.989674 -1.622956
G2 1 -2.411192  0.009507
   2 -0.600632  0.059846
   3 -0.263834 -0.492322

In [46]:
df.loc["G1"]

          A         B
1  1.417773 -1.730436
2 -0.964440 -0.863955
3 -1.989674 -1.622956

In [47]:
df.loc["G1"].loc[1]

A    1.417773
B   -1.730436
Name: 1, dtype: float64

In [48]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [49]:
df.index.names

FrozenList([None, None])

In [50]:
df.index.names=["Grupo", "Numero"]
df

                     A         B
Grupo Numero
G1    1       1.417773 -1.730436
      2      -0.964440 -0.863955
      3      -1.989674 -1.622956
G2    1      -2.411192  0.009507
      2      -0.600632  0.059846
      3      -0.263834 -0.492322

In [51]:
df.xs("G1")

               A         B
Numero
1       1.417773 -1.730436
2      -0.964440 -0.863955
3      -1.989674 -1.622956

In [52]:
df.xs(1, level="Numero")

              A         B
Grupo
G1     1.417773 -1.730436
G2    -2.411192  0.009507

In [53]:
df.xs(2, level="Numero")

              A         B
Grupo
G1    -0.964440 -0.863955
G2    -0.600632  0.059846

In [54]:
df.xs(3, level="Numero")

              A         B
Grupo
G1    -1.989674 -1.622956
G2    -0.263834 -0.492322

# 6 - Dados Ausentes

In [55]:
df = pd.DataFrame({
    "A" : [1, 2, np.nan],
    "B" : [4, np.nan, np.nan],
    "C" : [7, 1, 3] 
})
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [56]:
df.dropna(axis=0)

     A    B  C
0  1.0  4.0  7

In [57]:
df.dropna(axis=1)

   C
0  7
1  1
2  3

In [58]:
df.dropna(axis=1, thresh=3)

   C
0  7
1  1
2  3

In [59]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  7
1  2.0  1
2  NaN  3

In [60]:
df.dropna(axis=1, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [61]:
df.dropna(axis=0, thresh=3)

     A    B  C
0  1.0  4.0  7

In [62]:
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1

In [63]:
df.dropna(axis=0, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [64]:
df.fillna("TEXTANDO")

          A         B  C
0       1.0       4.0  7
1       2.0  TEXTANDO  1
2  TEXTANDO  TEXTANDO  3

In [65]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  1
2  0.0  0.0  3

In [66]:
df["B"].fillna("b")

0    4.0
1      b
2      b
Name: B, dtype: object

In [67]:
df.ffill()

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  1
2  2.0  4.0  3

# 7 - Groupby

In [68]:
data = {"Classe" : "Junior Junior Pleno Pleno Senior Senior".split(),
        "Nome" : "Jorge Carlos Roberta Patricia Bruno Vera".split(),
        "Venda" : [200, 120, 340, 124, 243, 350]}

df = pd.DataFrame(data)
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [74]:
df.groupby("Classe").sum()

C:\Users\arthu\AppData\Local\Temp\ipykernel_16440\4043718333.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Classe").sum()

        Venda
Classe
Junior    320
Pleno     464
Senior    593

In [75]:
df.groupby("Classe").mean()

C:\Users\arthu\AppData\Local\Temp\ipykernel_16440\2445507726.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Classe").mean()

        Venda
Classe
Junior  160.0
Pleno   232.0
Senior  296.5

In [76]:
df.groupby("Classe").max()

           Nome  Venda
Classe
Junior    Jorge    200
Pleno   Roberta    340
Senior     Vera    350

In [77]:
df.groupby("Classe").min()

            Nome  Venda
Classe
Junior    Carlos    120
Pleno   Patricia    124
Senior     Bruno    243

In [78]:
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [85]:
# Ele crio 1 ponteiro, ele só ta cemelhando a original, ai altero o DF2 alterou o df original
df2 = df
df2["Venda"] = [1,2,3,4,5,6]

In [86]:
df

   Classe      Nome  Venda
0  Junior     Jorge      1
1  Junior    Carlos      2
2   Pleno   Roberta      3
3   Pleno  Patricia      4
4  Senior     Bruno      5
5  Senior      Vera      6

In [87]:
df2

   Classe      Nome  Venda
0  Junior     Jorge      1
1  Junior    Carlos      2
2   Pleno   Roberta      3
3   Pleno  Patricia      4
4  Senior     Bruno      5
5  Senior      Vera      6

In [89]:
# Fazer do jeito certo
df = pd.DataFrame(data)
df2 = df.copy()
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [90]:
df2["Venda"] = [1,2,3,4,5,6]
df2

   Classe      Nome  Venda
0  Junior     Jorge      1
1  Junior    Carlos      2
2   Pleno   Roberta      3
3   Pleno  Patricia      4
4  Senior     Bruno      5
5  Senior      Vera      6

In [91]:
df3 = pd.concat([df, df2])
df3

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350
0  Junior     Jorge      1
1  Junior    Carlos      2
2   Pleno   Roberta      3
3   Pleno  Patricia      4
4  Senior     Bruno      5
5  Senior      Vera      6

In [94]:
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Junior Carlos      122
       Jorge       201
Pleno  Patricia    128
       Roberta     343
Senior Bruno       248
       Vera        356

# 8 - Combinar DataFrames

In [96]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [97]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [98]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [99]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concaternar

In [100]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [101]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Mesclar

In [102]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [103]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [104]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [105]:
pd.merge(esquerda, direita, on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [106]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [107]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [108]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [109]:
pd.merge(esquerda, direita, on=["key1","key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [110]:
pd.merge(esquerda, direita, how="outer", on=["key1","key2"])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

## Juntar

In [111]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [112]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [113]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [114]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [115]:
esquerda.join(direita, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# 9 - Operações